In [3]:
import pandas as pd
employees = pd.DataFrame({
    "EmpID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"],
    "DeptID": [10, 20, 30]
})

departments = pd.DataFrame({
    "DeptID": [10, 20, 40],
    "DeptName": ["HR", "Engineering", "Marketing"]
})

In [4]:
employees

   EmpID     Name  DeptID
0      1    Alice      10
1      2      Bob      20
2      3  Charlie      30

In [5]:
departments

   DeptID     DeptName
0      10           HR
1      20  Engineering
2      40    Marketing

<h1>Merge Like SQL: pd.merge()</h1>

<h3>Inner Join (default)</h3>

In [7]:
pd.merge(employees,departments,on="DeptID")    #Inner Join

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

<h3>Left Join</h3>

In [9]:
pd.merge(employees,departments,on="DeptID",how="left")   #Left Join    ;   Keeps all employees, fills NaN where no match.

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      30          NaN

<h3>Right Join</h3>

In [11]:
pd.merge(employees,departments,on="DeptID",how="right")     #Right Join    ; Keeps all departments, even if no employee

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

<h3>Outer Join</h3>

In [12]:
pd.merge(employees, departments, on="DeptID", how="outer")     #Outer Join   ;  Includes all data, fills missing with NaN

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10           HR
1    2.0      Bob      20  Engineering
2    3.0  Charlie      30          NaN
3    NaN      NaN      40    Marketing

<h1>Concatenating DataFrames</h1>
Use pd.concat() to stack datasets either vertically or horizontally.

In [14]:
df1 = pd.DataFrame({"Name": ["Alice", "Bob"]})
df2 = pd.DataFrame({"Name": ["Charlie", "David"]})
df1

    Name
0  Alice
1    Bob

In [15]:
df2

      Name
0  Charlie
1    David

<h3>Vertical (rows)</h3>

In [16]:
pd.concat([df1, df2])

      Name
0    Alice
1      Bob
0  Charlie
1    David

<h3>Horizontal (columns)</h3>

In [17]:
df1 = pd.DataFrame({"ID": [1, 2]})
df2 = pd.DataFrame({"Score": [90, 80]})
df1

   ID
0   1
1   2

In [18]:
df2

   Score
0     90
1     80

In [19]:
pd.concat([df1,df2],axis=1)

   ID  Score
0   1     90
1   2     80

Make sure indexes align when using axis=1

<h3>When to Use What?</h3>
<table>
  <thead>
    <tr>
      <th>Use Case</th>
      <th>Method</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td>SQL-style joins (merge keys)</td>
      <td><code>pd.merge()</code> or <code>.join()</code></td>
    </tr>
    <tr>
      <td>Stack datasets vertically</td>
      <td><code>pd.concat([df1, df2])</code></td>
    </tr>
    <tr>
      <td>Combine different features side-by-side</td>
      <td><code>pd.concat([df1, df2], axis=1)</code></td>
    </tr>
    <tr>
      <td>Align on index</td>
      <td><code>.join()</code> or <code>merge</code> with <code>right_index=True</code></td>
    </tr>
  </tbody>
</table>

<h1>Summary:</h1>
<ul>
    <li>Use merge() like SQL joins (inner, left, right, outer)</li>
    <li>Use concat() to stack DataFrames (rows or columns)</li>
</ul>